jintu123000/Smart_Door_Lock_Based_on_STM32/key_lock/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
#define u8 unsigned char 
#define u16 unsigned int
#define u32 unsigned long
typedef u8 uint8_t;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
int fputc(int c,FILE *stream);
void system_state_change(void);
void statemachine_show(u8 machine_state);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ROW3_Pin GPIO_PIN_0
#define ROW3_GPIO_Port GPIOF
#define LED_Pin GPIO_PIN_1
#define LED_GPIO_Port GPIOF
#define COL1_Pin GPIO_PIN_0
#define COL1_GPIO_Port GPIOA
#define COL2_Pin GPIO_PIN_1
#define COL2_GPIO_Port GPIOA
#define COL3_Pin GPIO_PIN_4
#define COL3_GPIO_Port GPIOA
#define COL4_Pin GPIO_PIN_5
#define COL4_GPIO_Port GPIOA
#define ROW1_Pin GPIO_PIN_6
#define ROW1_GPIO_Port GPIOA
#define ROW2_Pin GPIO_PIN_7
#define ROW2_GPIO_Port GPIOA
#define RELAY_Pin GPIO_PIN_1
#define RELAY_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
